MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH064/mcu.h
extern volatile ___ICDSTATbits_t _ICDSTATbits __asm__ ("_ICDSTAT") __attribute__((section("sfrs"), address(0xBF801140)));
#define OSCCON OSCCON
extern volatile uint32_t   OSCCON __attribute__((section("sfrs"), address(0xBF801200)));
typedef struct {
  uint32_t OSWEN:1;
  uint32_t SOSCEN:1;
  uint32_t :1;
  uint32_t CF:1;
  uint32_t SLPEN:1;
  uint32_t :2;
  uint32_t CLKLOCK:1;
  uint32_t NOSC:3;
  uint32_t :1;
  uint32_t COSC:3;
  uint32_t :6;
  uint32_t SLP2SPD:1;
  uint32_t :1;
  uint32_t DRMEN:1;
  uint32_t FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs"), address(0xBF801200)));
extern volatile uint32_t        OSCCONCLR __attribute__((section("sfrs"),address(0xBF801204)));
extern volatile uint32_t        OSCCONSET __attribute__((section("sfrs"),address(0xBF801208)));
extern volatile uint32_t        OSCCONINV __attribute__((section("sfrs"),address(0xBF80120C)));
#define OSCTUN OSCTUN
extern volatile uint32_t   OSCTUN __attribute__((section("sfrs"), address(0xBF801210)));
typedef struct {
  uint32_t TUN:6;
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs"), address(0xBF801210)));
extern volatile uint32_t        OSCTUNCLR __attribute__((section("sfrs"),address(0xBF801214)));
extern volatile uint32_t        OSCTUNSET __attribute__((section("sfrs"),address(0xBF801218)));
extern volatile uint32_t        OSCTUNINV __attribute__((section("sfrs"),address(0xBF80121C)));
#define SPLLCON SPLLCON
extern volatile uint32_t   SPLLCON __attribute__((section("sfrs"), address(0xBF801220)));
typedef struct {
  uint32_t PLLRANGE:3;
  uint32_t :4;
  uint32_t PLLICLK:1;
  uint32_t PLLIDIV:3;
  uint32_t :5;
  uint32_t PLLMULT:7;
  uint32_t :1;
  uint32_t PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs"), address(0xBF801220)));
extern volatile uint32_t        SPLLCONCLR __attribute__((section("sfrs"),address(0xBF801224)));
extern volatile uint32_t        SPLLCONSET __attribute__((section("sfrs"),address(0xBF801228)));
extern volatile uint32_t        SPLLCONINV __attribute__((section("sfrs"),address(0xBF80122C)));
#define RCON RCON
extern volatile uint32_t   RCON __attribute__((section("sfrs"), address(0xBF801240)));
typedef struct {
  uint32_t POR:1;
  uint32_t BOR:1;
  uint32_t IDLE:1;
  uint32_t SLEEP:1;
  uint32_t WDTO:1;
  uint32_t DMTO:1;
  uint32_t SWR:1;
  uint32_t EXTR:1;
  uint32_t :1;
  uint32_t CMR:1;
  uint32_t :16;
  uint32_t BCFGFAIL:1;
  uint32_t BCFGERR:1;
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs"), address(0xBF801240)));
extern volatile uint32_t        RCONCLR __attribute__((section("sfrs"),address(0xBF801244)));
extern volatile uint32_t        RCONSET __attribute__((section("sfrs"),address(0xBF801248)));
extern volatile uint32_t        RCONINV __attribute__((section("sfrs"),address(0xBF80124C)));
#define RSWRST RSWRST
extern volatile uint32_t   RSWRST __attribute__((section("sfrs"), address(0xBF801250)));
typedef struct {
  uint32_t SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs"), address(0xBF801250)));
extern volatile uint32_t        RSWRSTCLR __attribute__((section("sfrs"),address(0xBF801254)));
extern volatile uint32_t        RSWRSTSET __attribute__((section("sfrs"),address(0xBF801258)));
extern volatile uint32_t        RSWRSTINV __attribute__((section("sfrs"),address(0xBF80125C)));
#define RNMICON RNMICON
extern volatile uint32_t   RNMICON __attribute__((section("sfrs"), address(0xBF801260)));
typedef union {
  struct {
    uint32_t NMICNT:16;
    uint32_t WDTS:1;
    uint32_t CF:1;
    uint32_t :1;
    uint32_t GNMI:1;
    uint32_t :3;
    uint32_t SWNMI:1;
    uint32_t WDTO:1;
    uint32_t DMTO:1;
  };
  struct {
    uint32_t :24;
    uint32_t WDTR:1;
  };
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs"), address(0xBF801260)));
extern volatile uint32_t        RNMICONCLR __attribute__((section("sfrs"),address(0xBF801264)));
extern volatile uint32_t        RNMICONSET __attribute__((section("sfrs"),address(0xBF801268)));
extern volatile uint32_t        RNMICONINV __attribute__((section("sfrs"),address(0xBF80126C)));
#define PWRCON PWRCON
extern volatile uint32_t   PWRCON __attribute__((section("sfrs"), address(0xBF801270)));
typedef struct {
  uint32_t VREGS:1;
} __PWRCONbits_t;
extern volatile __PWRCONbits_t PWRCONbits __asm__ ("PWRCON") __attribute__((section("sfrs"), address(0xBF801270)));
extern volatile uint32_t        PWRCONCLR __attribute__((section("sfrs"),address(0xBF801274)));
extern volatile uint32_t        PWRCONSET __attribute__((section("sfrs"),address(0xBF801278)));
extern volatile uint32_t        PWRCONINV __attribute__((section("sfrs"),address(0xBF80127C)));
#define REFO1CON REFO1CON
extern volatile uint32_t   REFO1CON __attribute__((section("sfrs"), address(0xBF801280)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO1CONbits_t;
extern volatile __REFO1CONbits_t REFO1CONbits __asm__ ("REFO1CON") __attribute__((section("sfrs"), address(0xBF801280)));
extern volatile uint32_t        REFO1CONCLR __attribute__((section("sfrs"),address(0xBF801284)));
extern volatile uint32_t        REFO1CONSET __attribute__((section("sfrs"),address(0xBF801288)));
extern volatile uint32_t        REFO1CONINV __attribute__((section("sfrs"),address(0xBF80128C)));
#define REFO1TRIM REFO1TRIM
extern volatile uint32_t   REFO1TRIM __attribute__((section("sfrs"), address(0xBF801290)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO1TRIMbits_t;
extern volatile __REFO1TRIMbits_t REFO1TRIMbits __asm__ ("REFO1TRIM") __attribute__((section("sfrs"), address(0xBF801290)));
extern volatile uint32_t        REFO1TRIMCLR __attribute__((section("sfrs"),address(0xBF801294)));
extern volatile uint32_t        REFO1TRIMSET __attribute__((section("sfrs"),address(0xBF801298)));
extern volatile uint32_t        REFO1TRIMINV __attribute__((section("sfrs"),address(0xBF80129C)));
#define REFO2CON REFO2CON
extern volatile uint32_t   REFO2CON __attribute__((section("sfrs"), address(0xBF8012A0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO2CONbits_t;
