MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH064/mcu.h
extern volatile __ADC1TIMEbits_t ADC1TIMEbits __asm__ ("ADC1TIME") __attribute__((section("sfrs"), address(0xBF84B0D8)));
#define ADC2TIME ADC2TIME
extern volatile uint32_t   ADC2TIME __attribute__((section("sfrs"), address(0xBF84B0DC)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC2TIMEbits_t;
extern volatile __ADC2TIMEbits_t ADC2TIMEbits __asm__ ("ADC2TIME") __attribute__((section("sfrs"), address(0xBF84B0DC)));
#define ADC3TIME ADC3TIME
extern volatile uint32_t   ADC3TIME __attribute__((section("sfrs"), address(0xBF84B0E0)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC3TIMEbits_t;
extern volatile __ADC3TIMEbits_t ADC3TIMEbits __asm__ ("ADC3TIME") __attribute__((section("sfrs"), address(0xBF84B0E0)));
#define ADC4TIME ADC4TIME
extern volatile uint32_t   ADC4TIME __attribute__((section("sfrs"), address(0xBF84B0E4)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC4TIMEbits_t;
extern volatile __ADC4TIMEbits_t ADC4TIMEbits __asm__ ("ADC4TIME") __attribute__((section("sfrs"), address(0xBF84B0E4)));
#define ADCEIEN1 ADCEIEN1
extern volatile uint32_t   ADCEIEN1 __attribute__((section("sfrs"), address(0xBF84B0F0)));
typedef struct {
  uint32_t EIEN0:1;
  uint32_t EIEN1:1;
  uint32_t EIEN2:1;
  uint32_t EIEN3:1;
  uint32_t EIEN4:1;
  uint32_t EIEN5:1;
  uint32_t EIEN6:1;
  uint32_t EIEN7:1;
  uint32_t EIEN8:1;
  uint32_t EIEN9:1;
  uint32_t EIEN10:1;
  uint32_t EIEN11:1;
  uint32_t EIEN12:1;
  uint32_t EIEN13:1;
  uint32_t EIEN14:1;
  uint32_t EIEN15:1;
  uint32_t EIEN16:1;
  uint32_t EIEN17:1;
  uint32_t EIEN18:1;
} __ADCEIEN1bits_t;
extern volatile __ADCEIEN1bits_t ADCEIEN1bits __asm__ ("ADCEIEN1") __attribute__((section("sfrs"), address(0xBF84B0F0)));
#define ADCEIEN2 ADCEIEN2
extern volatile uint32_t   ADCEIEN2 __attribute__((section("sfrs"), address(0xBF84B0F4)));
typedef struct {
  uint32_t :11;
  uint32_t EIEN43:1;
  uint32_t EIEN44:1;
} __ADCEIEN2bits_t;
extern volatile __ADCEIEN2bits_t ADCEIEN2bits __asm__ ("ADCEIEN2") __attribute__((section("sfrs"), address(0xBF84B0F4)));
#define ADCEISTAT1 ADCEISTAT1
extern volatile uint32_t   ADCEISTAT1 __attribute__((section("sfrs"), address(0xBF84B0F8)));
typedef struct {
  uint32_t EIRDY0:1;
  uint32_t EIRDY1:1;
  uint32_t EIRDY2:1;
  uint32_t EIRDY3:1;
  uint32_t EIRDY4:1;
  uint32_t EIRDY5:1;
  uint32_t EIRDY6:1;
  uint32_t EIRDY7:1;
  uint32_t EIRDY8:1;
  uint32_t EIRDY9:1;
  uint32_t EIRDY10:1;
  uint32_t EIRDY11:1;
  uint32_t EIRDY12:1;
  uint32_t EIRDY13:1;
  uint32_t EIRDY14:1;
  uint32_t EIRDY15:1;
  uint32_t EIRDY16:1;
  uint32_t EIRDY17:1;
  uint32_t EIRDY18:1;
} __ADCEISTAT1bits_t;
extern volatile __ADCEISTAT1bits_t ADCEISTAT1bits __asm__ ("ADCEISTAT1") __attribute__((section("sfrs"), address(0xBF84B0F8)));
#define ADCEISTAT2 ADCEISTAT2
extern volatile uint32_t   ADCEISTAT2 __attribute__((section("sfrs"), address(0xBF84B0FC)));
typedef struct {
  uint32_t :11;
  uint32_t EIRDY43:1;
  uint32_t EIRDY44:1;
} __ADCEISTAT2bits_t;
extern volatile __ADCEISTAT2bits_t ADCEISTAT2bits __asm__ ("ADCEISTAT2") __attribute__((section("sfrs"), address(0xBF84B0FC)));
#define ADCANCON ADCANCON
extern volatile uint32_t   ADCANCON __attribute__((section("sfrs"), address(0xBF84B100)));
typedef struct {
  uint32_t ANEN0:1;
  uint32_t ANEN1:1;
  uint32_t ANEN2:1;
  uint32_t ANEN3:1;
  uint32_t ANEN4:1;
  uint32_t :2;
  uint32_t ANEN7:1;
  uint32_t WKRDY0:1;
  uint32_t WKRDY1:1;
  uint32_t WKRDY2:1;
  uint32_t WKRDY3:1;
  uint32_t WKRDY4:1;
  uint32_t :2;
  uint32_t WKRDY7:1;
  uint32_t WKIEN0:1;
  uint32_t WKIEN1:1;
  uint32_t WKIEN2:1;
  uint32_t WKIEN3:1;
  uint32_t WKIEN4:1;
  uint32_t :2;
  uint32_t WKIEN7:1;
  uint32_t WKUPCLKCNT:4;
} __ADCANCONbits_t;
extern volatile __ADCANCONbits_t ADCANCONbits __asm__ ("ADCANCON") __attribute__((section("sfrs"), address(0xBF84B100)));
#define ADC0CFG ADC0CFG
extern volatile uint32_t   ADC0CFG __attribute__((section("sfrs"), address(0xBF84B180)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC0CFGbits_t;
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF84B180)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF84B184)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF84B184)));
#define ADC2CFG ADC2CFG
extern volatile uint32_t   ADC2CFG __attribute__((section("sfrs"), address(0xBF84B188)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC2CFGbits_t;
extern volatile __ADC2CFGbits_t ADC2CFGbits __asm__ ("ADC2CFG") __attribute__((section("sfrs"), address(0xBF84B188)));
#define ADC3CFG ADC3CFG
extern volatile uint32_t   ADC3CFG __attribute__((section("sfrs"), address(0xBF84B18C)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC3CFGbits_t;
extern volatile __ADC3CFGbits_t ADC3CFGbits __asm__ ("ADC3CFG") __attribute__((section("sfrs"), address(0xBF84B18C)));
#define ADC4CFG ADC4CFG
extern volatile uint32_t   ADC4CFG __attribute__((section("sfrs"), address(0xBF84B190)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC4CFGbits_t;
extern volatile __ADC4CFGbits_t ADC4CFGbits __asm__ ("ADC4CFG") __attribute__((section("sfrs"), address(0xBF84B190)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF84B19C)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
extern volatile __ADC7CFGbits_t ADC7CFGbits __asm__ ("ADC7CFG") __attribute__((section("sfrs"), address(0xBF84B19C)));
#define ADCSYSCFG0 ADCSYSCFG0
extern volatile uint32_t   ADCSYSCFG0 __attribute__((section("sfrs"), address(0xBF84B1C0)));
typedef struct {
  uint32_t AN0:1;
  uint32_t AN1:1;
  uint32_t AN2:1;
  uint32_t AN3:1;
  uint32_t AN4:1;
  uint32_t AN5:1;
  uint32_t AN6:1;
  uint32_t AN7:1;
  uint32_t AN8:1;
  uint32_t AN9:1;
  uint32_t AN10:1;
  uint32_t AN11:1;
  uint32_t AN12:1;
  uint32_t AN13:1;
  uint32_t AN14:1;
  uint32_t AN15:1;
  uint32_t AN16:1;
  uint32_t AN17:1;
  uint32_t AN18:1;
  uint32_t AN19:1;
  uint32_t AN20:1;
  uint32_t AN21:1;
  uint32_t AN22:1;
  uint32_t AN23:1;
  uint32_t AN24:1;
  uint32_t AN25:1;
  uint32_t AN26:1;
  uint32_t AN27:1;
  uint32_t AN28:1;
  uint32_t AN29:1;
  uint32_t AN30:1;
  uint32_t AN31:1;
} __ADCSYSCFG0bits_t;
extern volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits __asm__ ("ADCSYSCFG0") __attribute__((section("sfrs"), address(0xBF84B1C0)));
#define ADCSYSCFG1 ADCSYSCFG1
extern volatile uint32_t   ADCSYSCFG1 __attribute__((section("sfrs"), address(0xBF84B1C4)));
typedef struct {
  uint32_t AN32:1;
  uint32_t AN33:1;
  uint32_t AN34:1;
  uint32_t AN35:1;
  uint32_t AN36:1;
  uint32_t AN37:1;
  uint32_t AN38:1;
  uint32_t AN39:1;
  uint32_t AN40:1;
  uint32_t AN41:1;
  uint32_t AN42:1;
  uint32_t AN43:1;
  uint32_t AN44:1;
  uint32_t AN45:1;
  uint32_t AN46:1;
  uint32_t AN47:1;
  uint32_t AN48:1;
  uint32_t AN49:1;
  uint32_t AN50:1;
  uint32_t AN51:1;
  uint32_t AN52:1;
  uint32_t AN53:1;
  uint32_t AN54:1;
  uint32_t AN55:1;
  uint32_t AN56:1;
  uint32_t AN57:1;
  uint32_t AN58:1;
  uint32_t AN59:1;
  uint32_t AN60:1;
  uint32_t AN61:1;
  uint32_t AN62:1;
  uint32_t AN63:1;
} __ADCSYSCFG1bits_t;
extern volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits __asm__ ("ADCSYSCFG1") __attribute__((section("sfrs"), address(0xBF84B1C4)));
#define ADCDATA0 ADCDATA0
extern volatile uint32_t   ADCDATA0 __attribute__((section("sfrs"), address(0xBF84B200)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA0bits_t;
